[
{"tv_show_name": "Brooklyn Nine-Nine", "imdb_score": 8.4, "imdb_score_num_users": 144407, "top_rated_rank": "238", "story_keywords": ["police", "new york city", "police detective", "police captain", "female cop"], "genres": ["Comedy", "Crime"], "tv_rating": "TV-14", "official_sites": [{"social_media_site": "Official Facebook", "social_media_link": "https://www.imdb.com/offsite/?page-action=offsite-facebook&token=BCYt3rnkGCRQh8hUWvuj_k1p3sGK1TSGn4u10javycSryx6wIUQ-TgBHtRQouEdA1YfcfjaTZNjJ%0D%0AYvBlDYMki1NXOQS3DjIf9W8XNhSAPFuwys1b-xXjJWztaI1_Nkxp7TxtzQ4bUHvDxDSX1930J4pN%0D%0Au1DRheVAFArN0HKrjH4ulcZnZBZDIZrnPRbCvgllLuZWG6JzR0-DqpYO6AZVydSXb0lAvlhqJ7ga%0D%0AtJc6NDarA9lgpns5-_ggR1MF2afUa11t%0D%0A&ref_=ttext_osites_os_0"}, {"social_media_site": "Official Instagram", "social_media_link": "https://www.imdb.com/offsite/?page-action=offsite-instagram&token=BCYv2jaDthW84M5dUOkp8hjYXWQ42LgnNh7W5GdsqNFC50Ine0UCGIy_ZWF2eD7rDa7azuZngxKR%0D%0AoOBPoo_GH0mxvmamCPjn9GrHFp-RwZx9amBUQ1FKp4HjNlKG_lv71s1uRf1Fe0KcbxgLDF4jWnWG%0D%0ACOA5uviu-cv8BWBD52CcIDssDT5km0n0DeGlln0Wb5XXupRTPvtlkL3I5jxJuR6BC0_B7AmGtudj%0D%0AH0G9Z9NnV2Y%0D%0A&ref_=ttext_osites_os_1"}, {"social_media_site": "Official Twitter", "social_media_link": "https://www.imdb.com/offsite/?page-action=offsite-twitter&token=BCYjWZQn6HGRF0XUG6ahEBdcz8kUpGD5rWOKTIghXXMnTlzIsz__A1UB1SNoxmfOuLtPZDc55xvV%0D%0ATxrgHOcu166zGM_n2gR0WYv_wOJELpajEnGxOhT4a1yk3H8HAf9IMPyBgf6GPtq89z7Tbw6_eOOb%0D%0A-Bzdya8tW069pN_l0Zp_cfZZUuHg5ARHP8QK-63ncvoH7JpS2R1pr3cgOUgplJ6OppsPYwaOS4J2%0D%0A3OM1BDIDI6M%0D%0A&ref_=ttext_osites_os_3"}, {"social_media_site": "Official YouTube", "social_media_link": "https://www.imdb.com/offsite/?page-action=offsite-youtube&token=BCYs5XF25-P6BmJo6SP1GVmSBhxDCoadfF3yXK9eBXlOMGquVJDumeO-SRl-RcHtR-5D7-QMjsJ6%0D%0AK9ouCnGifevDgnOk5uT2Zkc1Yr10okl-pW57_B7gE5kex5qacSdMHJafIprPLUjIklYO9Us0TNQX%0D%0A-VQfH6FFnJCc1TfW4WJxcX4RjP1ye8oqCZTgAjR3VNf-QDBoh6uLrV4B0FSfIBwpIvrA9yHNJpFm%0D%0AJGB7ZH764mdX5HXQC63KWt0h7Zu9o0ndqnfzNGhoLFXZVyTgGNEAbA%0D%0A&ref_=ttext_osites_os_4"}], "country": ["USA"], "langauge": ["English"], "release_date": "17 September 2013", "runtime": "PT22M", "user_reviews": [{"review_score": "10", "review_UID": "salmonwaffle", "review_date": "21 November 2017", "review_title": "Cured my depression", "review_text": "As of November 2017, due to Brooklyn Nine Nine I can safely say that my depression has been helped because of this TV show. I know it may sound stupid but when I watch the show I just fill up with laughter which most likely has resulted in me not committing suicide.Thank You 99.", "percent_found_helpful": 93.46}, {"review_score": "10", "review_UID": "katrinaysabelr", "review_date": "27 April 2018", "review_title": "Please don't cancel Brooklyn Nine-Nine", "review_text": "This show is a masterpiece. I honestly don't know why and how it's underrated. Sure, I love a good sitcom like Friends, and although some might not agree, I actually find B99 more hilarious compared to those kind of shows.Let's see:B99 doesn't need those fake cheap laugh sound effects after every joke / funny dialogueThe dialogue is funny as hell and not corny. And the acting? Damn. I don't know how they can keep a straight face while doing those scenes, especially Andre.The diversity of the show. A black gay cop? Latina detectives? That's only the beginning.It's realistic. Not realistic in a sense that everything that happens there happens in real life (such as the comedic police situations). What I meant was, it doesn't need to be overly dramatic to get you hooked. The characters are all so mature, and they portray great friendship.Healthy relationships like what Jake and Amy have. Also, they do not promote nor show toxicity in any way.I'm gonna be really sad if B99 wont be renewed for a 6th season, because it deserves so much more than that.", "percent_found_helpful": 93.66}, {"review_score": "10", "review_UID": "ansonlam", "review_date": "3 January 2018", "review_title": "Delightful show, No Laugh Tracks, Golden Content", "review_text": "Brooklyn Nine-Nine is definitely one of my favorite ever sitcom. It's a show of pure comedy with humorous stories that are naturally delivered by the lovely actors and actresses, but also with a consistent storyline which a lot of sitcoms lack. The other thing I've noticed which makes this show better is the exclusion of laugh tracks. Although, laugh tracks do, to a certain extent, seem to make shows more hilarious and to a point where even if you don't understand a joke, you'd laugh. But no, this show has no cheats like that and amuses viewers with original content.\nThe show also does not rely on one-liners or simple jokes, and instead, make use of the characters' personalities and actions to entertain viewers, which is pretty smart. Some might think that entertainment with personalities do not last as they stay the same and eventually people would get tired of them. However, with the ongoing characters development, their personalities and stories are often changing, which makes the show so fresh all the time.", "percent_found_helpful": 93.83}, {"review_score": "10", "review_UID": "nickferraro-29294", "review_date": "13 June 2018", "review_title": "Funniest show in a long time", "review_text": "Please please please don't cancel the show,this show is too funny to be canceled especially on a cliff hanger", "percent_found_helpful": 92.06}, {"review_score": "10", "review_UID": "jsmn-kane", "review_date": "20 June 2018", "review_title": "Hilarious!", "review_text": "I just started watching this show after my daughter talked me into it. I was laughing so hard I was crying sometimes. I love the characters, they play off each other perfectly and I have no idea how the Captain keeps a straight face all the time. Some shows just have it-that chemistry, good actors, good writing. This is one of those shows. I was sad to hear they cancelled it, but hopeful now that I hear another company picked it up. All I can hope for is the same experience as the show goes on.", "percent_found_helpful": 94.29}, {"review_score": "9", "review_UID": "montez7679", "review_date": "19 October 2013", "review_title": "I can't understand who wouldn't find this show fantastic", "review_text": "I respect that different people have different tastes in music, clothes, women, movies etc...but if you are saying that this show is bad I really feel like your sense of humor is lacking. I'm a detective for one of the largest police departments in the country and I will advise everyone that doesn't realize it but this show is closer to how real police go about their day than any of those CSI, or garbage procedural shows. Cops do all that stuff all day...pranking each other, busting balls, trying to have a little fun. The job gets a little heavy sometimes so if we didn't have some fun it would be long days. This show is hilarious and perfectly timed retorts by Braugher and Crews are classic. Its the low key lines that make I hilarious...the over the top cheap laughs are somethkng all shows have to do to please the masses...who are stupid. Pay attention to the underlying comedy...its priceless.......\"Terry does love yogurt\"", "percent_found_helpful": 82.2}, {"review_score": "10", "review_UID": "jasper-bielski", "review_date": "3 June 2018", "review_title": "Binged and enjoyed", "review_text": "This show is just good fun to watch good by yourself or with someone it's just enjoyable tv great stories and characters please do watch this show it's worth it", "percent_found_helpful": 90.24}, {"review_score": "10", "review_UID": "kittykatoncloud9", "review_date": "19 April 2018", "review_title": "Comfort-Food of Shows", "review_text": "B99 is a rare gem among serial comedy duds. It's such a smart and fast-paced show that never fails to make me laugh, smile, and sometimes cry at very touching and human moments. This is a comfort show for me and I love rewatching for the running gags, callbacks to previous episodes, and to see the character development as they grow as people in ways that don't feel forced or contrived. The characters start out fairly rough and jagged with their own individual struggles but grow as a squad after the introduction of Capt. Holt. This is a feature, not a bug! The point of the show is that they're flawed! Do not listen to anyone who rates this lower than a seven, most of the people who do can't be bothered to spell names right (racist much?).", "percent_found_helpful": 86.36}, {"review_score": "10", "review_UID": "faithfulgrace-330-50991", "review_date": "20 July 2018", "review_title": "A delight from the start", "review_text": "Spoiler alert: this is one of my favorite shows. An incredible blend of lovable and hilarious characters. So much fun. So many laugh out loud moments. Even on a second full watch through I find myself laughing loudly in delight at this great gem of a show. It's a must watch IMO", "percent_found_helpful": 90.0}, {"review_score": "10", "review_UID": "prashantsaxena2790", "review_date": "22 October 2013", "review_title": "One of the most promising comedy shows to air this season", "review_text": "Brooklyn Nine Nine is a new age police procedural comedy with an excellent cast and spectacular production. But that isn't what makes the show great, rather its something very trivial. The show, being a comedy, peculiarly enough,doesn't use any laugh track or a live audience to record laughs. In fact, they just provide us with a sketch where the viewer can decide whether it was funny enough for him to enjoy (laugh) or not.The show should be credited for its humorous subplots within an episode.The cast also portray their characters in an outstandingly witty fashion. The writer's vision of a comic police station is right on the money. I may have been biased so i couldn't think of flaws. An Amazing show. One of 2013's best.", "percent_found_helpful": 78.57}, {"review_score": "10", "review_UID": "lucienstephens", "review_date": "19 February 2018", "review_title": "I love this series so much if you haven't hated already binge it now!", "review_text": "Brooklyn nine nine required a few episodes for me to really get into it but when I did I couldn't stop watching it. this American sitcom is based in a police station. Each episode is completely unique and stays at a consistent level of quality for all 4 seasons that I have enjoyed. As I got into the thickness of the series I got to know each and every hilarious character and by season 3 I loved every well acted character. I may be a little biased but whether or not I know your gonna love it so watch it now. As a note I will say that like me your going to have to watch a few episodes to get into it.", "percent_found_helpful": 85.37}, {"review_score": "10", "review_UID": "justadj00", "review_date": "13 May 2018", "review_title": "Best comedy on tv.", "review_text": "The cold opens for B99 are always hilarious. I love this show so much. It does a great job of balancing comedy with personal issues. It is the only show on that is consistently funny every single week.", "percent_found_helpful": 84.85}, {"review_score": "10", "review_UID": "ben-798-604758", "review_date": "13 November 2013", "review_title": "Very Funny, Great Cast, Great Characters", "review_text": "It may be too soon to say having not even finished their first season yet, but since i haven't seen an episode i didn't enjoy i think its safe to say this one is a keeper. The one issue i have is how short the episodes are, which means if you watch the trailer for the series you've already seen half of the first episode. There's a lot of great jokes particularly regarding the characters, each one with their own eccentric personalities, and one of the things i love about this show is that it doesn't have to play on racial stereotypes to be funny. Its got one of the most ethnically diverse casts out there but it doesn't even care because thats not who they are. for instance Terry Crews doesn't play the hardened streetwise character, he plays the hulkish desk sergeant who is absolutely terrified of guns. Seeing Terry Crews scream like a little girl and freak out trying to put a magical princess castle together is just priceless gold. Or Rosa, the extremely abrasive criminally adept cop who doesn't have an off switch for her intimidating nature. The conversations between her and the timid pushover Detective Boyle make for some great television.\"go to your happy place\" \"what is that? that sounds stupid.\"There's also the expressionless, unreadable openly gay police captain who is anything but a gay stereotype, the sociopathically manipulative secretary who in her own words \"thrives on dysfunctional relationships\", and detective scully who is in every sense of the word a failure, smelly, lazy, unadept and just all around a horrible police officer. Andy Sandberg really is just the cherry on top of a great ensemble cast. He plays his normal goofy immature character, but he's not without his redeeming qualities. He embarrasses himself on more than one occasion but this causes people to underestimate him and his wit which he uses to actually solve crimes. This and his competitiveness with detective Santiago cause him to keep his successes just above his screw-ups, and if he didn't actually solve cases he'd probably be fired for goofing off on the job. Overall i want to see Peralta learn some restraint and become a bit more devious, the competitive sexual tension between Peralta and Santiago become an even more competitive relationship and for Boyle to have a life changing experience when he finally sleeps with Rosa... Or just embarrass himself with a past due, overbearing attempt to become a man.", "percent_found_helpful": 75.19}, {"review_score": "10", "review_UID": "nazibabezia", "review_date": "23 July 2018", "review_title": "One of the best shows", "review_text": "This show is one of the funniest shows I have witnessed in recent years. It's original and the characters are very funny. Love this show!", "percent_found_helpful": 84.0}, {"review_score": "9", "review_UID": "Chanandler-Bong", "review_date": "15 January 2014", "review_title": "Hilarious", "review_text": "So I watch a lot of American cop shows like Criminal Minds and Castle, but as much as I love them, sometimes I feel like they're hugely unrealistic and over-dramatised. Brooklyn Nine-nine is a play on those kind of cop shows and it does it spectacularly. Also it even has a more realistic feel than the other cop shows. The writing is genius and the acting is spot on. I haven't seen a show this good in a while. It's funny, clever and endearing. I saw it on the Golden Globes and I'd seen a trailer for it and I was incredibly skeptical when I watched it thinking it'd be one of the awful American spoofs they do. But I was highly surprised making me love it even more!", "percent_found_helpful": 70.94}, {"review_score": null, "review_UID": "jellyneckr", "review_date": "9 January 2014", "review_title": "Best comedy on television", "review_text": "The track record of cop comedies on television is not inspiring. While successful police dramas have ruled the airwaves for decades, the same cannot be said for cop shows that aim for laughs. There are some noticeable exceptions such as \"Car 54, Where Are You?\" and the very short-lived \"Police Squad\", but for the most part, it has been hard for show-runners to make crime a funny topic on TV. \"Brooklyn Nine-Nine\" could have ended up being super broad like \"Police Academy: The Series\" or \"Reno 911\", but luckily creators Dan Goor and Michael Schur have made the decision to keep the show somewhat grounded in reality, allowing for viewers to relate to the characters without them becoming complete cartoons. In casting Andy Samberg as the lead, there was the risk of \"Brooklyn Nine-Nine\" coming across too goofy. However, Samberg is at his career best here as Jake Peralta, a childish and immature detective who just happens to be very good at his profession. Samberg is great at delivering the most ridiculous and silly lines of dialogue without mugging for the camera in the way that some might expect a former \"Saturday Night Live\" performer to do. Half of what Peralta says is either completely juvenile or inappropriate, but because it never reaches cartoonish or mean-spirited heights, he remains likable and easy-to-root-for. The show may eventually reach a point where it may seem absurd that the character is able to keep his job, though that hasn't occurred yet.If \"Brooklyn Nine-Nine\" had just been a vehicle for Samberg, the show might have become stale after a few episodes. Wisely, the decision was made to make an ensemble series. It's typical for an ensemble to have one or two characters that aren't quite as funny or interesting as the others, but amazingly, every single character on \"Brooklyn-Nine Nine\" is excellently performed. Andre Braugher, Chelsea Peretti, Joe Lo Truglio, Melissa Fumero, Stephanie Beatriz, and Terry Crews are all perfectly cast in their respective roles and each have moments where they shine in every single episode. Crews is absolutely hilarious as squad leader Terry Jeffords, especially when the writers are able to make great use out of both his physical strength and priceless facial reactions. In addition to the main ensemble cast, the reoccurring duo of Dirk Blocker and Joel McKinnon Miller as Detectives Hitchcock and Scully, the two worst detectives in the department, are responsible for some of the best jokes of the series thus far. It's also worth noting the writers have made nice use of its guest stars including Craig Robinson, Andy Richter, Stacy Keach, and Dean Winters. Guest stars on sitcoms can be tricky and can often overshadow the episodes as a whole, but \"Brooklyn Nine-Nine\" almost always makes its guest stars fit organically into the plot in ways that never feel gimmicky or forced.Although there have only been a dozen episodes so far and there is always the chance that the broadness the show-runners have been so good at keeping down may eventually kick in, the series now remains as strong and frequently hilarious as any comedy on television at the moment. There isn't a particular formula that the show gets hung up on every week and more often than not, there seems to be an effort to get in a decent amount of character development by sitcom standards. If Fox is smart enough to keep \"Brooklyn-Nine Nine\" on for a while, it will almost certainly develop a cult following. If the ratings don't improve and only one season gets produced, at least the series will probably hold the distinction of not having a bad episode in the bunch. 9/10", "percent_found_helpful": 70.4}, {"review_score": "7", "review_UID": "Dunning-Kruger", "review_date": "19 September 2013", "review_title": "A surprisingly pleasant, silly yet witty show.", "review_text": "After first hearing about Brooklyn Nine-Nine, I was fairly skeptical about yet another attempt on Fox's part to regain their former position as king of network comedy, however; minutes after it had started, I was able to find an affection for this show that I haven't had for a comedy pilot since The Office.Anchored in large part by Andy Samberg's ironic sense of humor, it also features plenty of dead-pan humor and caricatures, much of it being a parody of the typical crime drama.Half-way through, I realized it felt fairly reminiscent of The Office's early days, unbeknownst to me that was intended to channel that style and humor, despite it not being a mockumentary.Personally, I felt it to be one of the strongest pilots for a comedy I had seen in a while. They introduce the audience to the characters in a way that doesn't come across as them trying to bluntly introduce us, as so many shows clumsy do; Shows that tell us how close two friends are in a way real people don't talk, by having one of them tell the other, \"I know you said you didn't want to hang out Friday but I'm your best friend and we're going to hang out.\" Brooklyn 9-9 accomplishes these crucial initial first impressions by not overstating the core personalities of the characters. Half way in, we quickly begin to experience the precincts average day and learn of the quirky interactions that occur between characters alongside the new C.O., Capt. Holt(Andre Braugher). Some characters do leave something to be desired in terms of having something to offer to the show, but the groundwork is solid.There certainly is the expected detective work, but the main focus is the ludicrous and off-beat styles of the detectives. One of the best things I like about this show, thus far, is the fact that it is able to surprise me with its jokes, most of which are not exactly the shock-value type that are only there because they're so random they're humorous. Though as I recall, that style is mixed in with other, more witty jokes.I don't see this as a show that will appeal to mass audiences, simply because it is more quirky and witty, though not necessarily requiring its viewers to think more about the jokes.People who enjoy(ed) shows like The Office, Parks and Rec., Community, South Park, Psych, possibly Modern Family, etc., will more likely than not find something to like about this show.Obviously not everyone will appreciate it, but I strongly encourage those who are interested in watching it, to watch the entire pilot before making a full opinion.In the end, Brooklyn Nine-Nine is a fun and silly satire about the clichés of police shows, while still able to not take itself too seriously.", "percent_found_helpful": 69.66}, {"review_score": "9", "review_UID": "jodyfranz", "review_date": "11 September 2018", "review_title": "Genuinely funny, light hearted, fast paced comedy", "review_text": "I tend to have to find things in between a kids show and adult shows so the whole family can watch and not want to pull our hair out listening to Peppa Pig's annoying voice. 99 did the trick for us. We watched the entire 5 seasons over many months and were entertained. I found myself wanting to watch the next episode before it was family time... so I ended up watching some episodes twice.Generally it is a bunch of cops trying to do their jobs. It's less about the situation and more about the dialogue and how it's delivered. The do come out with some serious situations every once in awhile but even then it's handled with the same comedic dialogue as most of the other shows. Very well done, will be waiting for more seasons.", "percent_found_helpful": 85.71}, {"review_score": "9", "review_UID": "spasticfreakshow", "review_date": "19 September 2013", "review_title": "Cop Shows: Prepare to be Mocked!", "review_text": "Equal parts Mockumentary-style Comedy + Cop Show = A perfect parody of detective shows. The star detective (played by Samberg) winningly carries the lead with charm (if not grace), but as part of a true ensemble cast, carefully crafted iconic roles played well, and all won me over in the first episode. The surprisingly gay new police chief is a riot for how he takes his zany team in stride, breaking character to enjoy their antics, while maintaining a strict iron-faced facade. Rosa, in particular, stands out as 'scary cop' - Stephanie Beatriz will be a breakout star with this role - you can't get enough of her...and if she and Clumsy Mousy Charles get together or even just continue to dance around it, they'll be the best, most hilarious parody of a Will They/Won't They ever! The producers claim to be channeling Barney Miller - a far-fetched chutzpadik claim for people who did NOT produce THAT 70s Show, because rarely have current television producers captured that classic 70s overt brand of comedy, but Brooklyn Nine-Nine has indeed! There's a bit of a Naked Gun feel to it as well, what with the vaguely idiotic running gags and horseplay, but Jake Peralta is sharper (and more competitive) than Frank Drebin - leaving Charles to play the fool for him. When Peralta solves crime, it's not accidental - but neither can you take it very seriously, as even the arrest is more of an SNL skit than a semblance of a cop show arrest. I watched the pilot more out of curiosity (and Samberg fan-girl-ing) then out of any hope I would add this to my roster, but wonder of wonders, this thing actually works! Creative and original \"detective\" comedy - I'll be watching.I'd recommend this to BOTH people who can't stand cop/detective shows and just want to look down their nose whilst laughing at them, AND to people who love cop/detective shows, so they can learn just how stereotypical, cliché and canned their favorites are.", "percent_found_helpful": 66.91}, {"review_score": "8", "review_UID": "MovieAddict2016", "review_date": "25 October 2013", "review_title": "Shows a lot of promise - a very likable new sitcom.", "review_text": "I'm confused by the reviewer (whose comment was featured on the IMDb page just now) who seemingly despised this program and wrote it off, apparently, because he or she felt Andre Braugher deserved better.I find this review odd, because \"Brooklyn Nine-Nine\" - if nothing else - comes across as a very likable show. Thankfully spared of talking-head interview segments that have dominated the American comedy scene since The Office, this show also thankfully features no laugh track. Thus, it both has the feel of an old-fashioned sitcom without the dated quality of one. It's actually quite a clever premise: it's a \"cop show\" but set in the workplace environment. This is a clever move as the show is able to subvert some of the stereotypical police procedural elements while also keeping stuff grounded and relatable by keeping the majority of the antics constrained to the police station.The cast is talented all across the board. One thing you might find as the show grows is that Andy Samberg will become more subdued in his approach. I say this because as of now he is clearly the \"star\" of the show and, as such, he's often given a lot of LOUD dialogue -- but this also happened to the Leslie Knope character in \"Parks and Recreation,\" and she ended up organically evolving into a much smarter and more likable character. I think once Brooklyn Nine-Nine finds its own footing and more firmly establishes its characters, things will settle into place. It's still a bit shaky but it's just the freshman season flaws. Very few comedy shows are at their best in their first seasons.I'm enjoying this quite a lot so far - it's not must-see-TV or anything of the sort, but it's likable, entertaining and shows a lot of promise. The talented cast really elevates the material and the show manages to subvert cop show clichés and workplace TV comedy tropes without seeming overly cynical or snide about it. That's really the best word I can think of summing it up with: likable.", "percent_found_helpful": 68.09}, {"review_score": "8", "review_UID": "StellarDread3", "review_date": "2 August 2017", "review_title": "This show is better than it should be", "review_text": "Brooklyn Nine-Nine is a show about a police precinct in Brooklyn and it follows a variety of characters, who are a bunch of misfits who when they get to work they do a really good job, there are weirdos, nerds, and one of the most egotistical characters you will ever likely see. Despite this all of the characters are amazing as they are all likable and have incredible chemistry which makes this show one you should watch.It mainly follows Jake Peralta who is a guy who loves his work, is incredibly immature and usually takes inspiration from action films like Die Hard whilst on a case. The show always follows the other characters in engaging and hilarious plot lines which also shows off different traits and experiences of their separate characters. Whilst it is an amazing show, it has it's flaws such as every finale has started to end in mostly the same way and the first couple of episodes of the next series will be centred around this one thing. As with any show there are some episodes that are not as good as the others, however after 4 seasons there are no seriously bad episodes so that is great.One last issue is that there is a duo in the precinct called Hitchcock and Scully who exist solely to be gross out characters (Which I don't particularly mind) and are essentially the exact same character, however they can be really funny and they do have characteristics even though they have the least amount of character development than anyone else in the show. So in conclusion this is an exceptional show which has a wide range of lovable characters and many different kinds of humour and jokes which are usually very funny. If you have seen a trailer for this show and it expect it to be another of those sitcom comedies like, New girl and The Big Bang Theory, it actually has a much higher level of quality then those two. (Personally I really like TBBT even though it got noticeably worse after a couple of seasons and NG I never really liked even though I watched all of the first season)So I seriously recommend this show and would say at least give one or two episodes a watch.Have a good one. :)", "percent_found_helpful": 75.0}, {"review_score": "10", "review_UID": "hockey-06834", "review_date": "20 November 2018", "review_title": "Amazing", "review_text": "This show is awesome. Characters are hilarious and it features great character development with characters like Capt. Holt becoming unexpectedly hilarious, jokes are super witty. I thought I had exhausted the comedy genre (especially of tv) until I found this. Please give it a chance and it surprising has only gotten funnier. Gave it 10 stars for anyone crazy enough to give it below a 9.", "percent_found_helpful": 83.33}, {"review_score": "8", "review_UID": "Syl", "review_date": "24 September 2013", "review_title": "Love Samberg & Braugher!", "review_text": "Who would think of this duo would be the best part of the series. Saturday Night Live's Adam Samberg plays Jake Peralta, a cop in Brooklyn, New York. The precinct gets a new captain played by Emmy winner and Homicide: Life on the Streets actor Andre Braugher who plays the straight man to Samberg's Peralta. Braugher is great in his role and one the reasons to watch and the other is Andy Samberg. I hope this show lasts the season. It isn't filmed in front of a live audience. It's more like other sitcoms today where they film in a studio and on location. It's good to have a sitcom in New York City than another crime drama. Audiences need to laugh more these days.", "percent_found_helpful": 64.0}, {"review_score": "10", "review_UID": "sinneraks", "review_date": "8 May 2018", "review_title": "I would give this show a 11 outta 10 if i could......", "review_text": "Truly a comedic masterpiece. Enjoy each and every episode. The Cast is perfectly en-sync and compliment each other.\nAndy Samberg a.k.a. Jake Peralta is the topping on the Nine-Nine Sundae (Without him the show just melts off).... He brings it all together. \nMelissa Fumero , Andre B. and Joe Lo T. (Along with Andy) are Amazing (Rather A-M-A-Z-I-N-G) at their roles and their characters seem to just envelope you into their roles and force you into binge watching the show from dusk to dawn.\nWhereas, Stephanie Beatriz, Terry Crews, Chelsea Peretti play their characters to perfection adding to the hysteria the show gets you into.....Love it....Love it.... Love the show...Never want the show to end...... Wish they keep renewing the series over and over again...Three Cheers for the Entire team ... Even Scully and Hitchcock .... and the other extras who keep coming in at different times.Keep up the Amazing work", "percent_found_helpful": 87.5}, {"review_score": "10", "review_UID": "mrsamg-95366", "review_date": "15 September 2018", "review_title": "BEST SHOW EVER", "review_text": "This has gotta be the best show on TV currently. I didn't watch it from season 1 but found them on Netflix and watched them all within a week! Just shows how hooked I am NINE NINE", "percent_found_helpful": 76.92}, {"review_score": "9", "review_UID": "marcolimsx", "review_date": "5 August 2018", "review_title": "Entertaining, hilarious, the best cop show", "review_text": "The best Comedy. The acting is superb, the plot is interesting. The first few episodes were weak but from then on the show grew a lot.", "percent_found_helpful": 76.92}, {"review_score": "10", "review_UID": "michaelradny", "review_date": "20 August 2015", "review_title": "Police Academy Step Aside", "review_text": "Comedy is a difficult thing to pull off, especially if you have to do it for around seventy episodes, but Brooklyn Nine-Nine does this to a tee. It's hilarious without fault, entertaining to the max and watchable, so watchable, binge watchable. The characters are all likable and relatable, which many shows fail to do without making one main character annoying or dislikable. It's also very much original, without being original if you know what I mean. It spoofs all cop shows, but does it in a way that the overall project feels fresh and like something you've never seen before. Brooklyn Nine-Nine is fantastic, a true gem for the silver screen. It faults only in the fact that it will almost kill you, and that is due to the suffocation when you can't breathe due to laughter. If you are a fan of comedy watch this. If you are a fan of cop films watch this. If you are a human being watch this!", "percent_found_helpful": 63.41}, {"review_score": "10", "review_UID": "livehealthybestrongas", "review_date": "18 October 2018", "review_title": "Love love love.", "review_text": "This is the best show EVER since friends. I think this is the next best TV show since FRIENDS.", "percent_found_helpful": 75.0}, {"review_score": "10", "review_UID": "talaisafae", "review_date": "15 October 2018", "review_title": "The best tv show Ever!", "review_text": "Honestly this is the best tv shows i ve ever seen, and ive seen a lot! It fills my heart with joy, very funny and incredible. I watch it every day and even watched all seasons for over 10 times and i am.never bored. I cant understand how it is not rated 10", "percent_found_helpful": 75.0}, {"review_score": "10", "review_UID": "taylorkingston", "review_date": "10 June 2015", "review_title": "Awesome", "review_text": "I love this show. It's so freaking funny. And I am ecstatic that it got a third season. I predict it will get many more. I like this show because it's a cop show, but it's not a serious drama. Instead, it's a comedy. This show has hilarious story lines and a fantastic cast that play their characters very well.This show is about the detective team of Brooklyn's 99th precinct, hence the title, Brooklyn Nine-Nine. Jake Peralta is a goofy, immature detective, but he's also very good at his job. His new commanding officer is not as laid back as his previous boss, so they don't get along at first. Boyle, Jake's best friend and side-kick, is a very funny man. Amy is the straight-up, do everything by-the-book girl on the squad. Gina is the funny, sometimes rude, assistant. Rosa is the cop you don't want to get into a fight with. And Scully and Hitchcock are just the best. Overall, I give this TV show a 10 out of 10, which in my ratings book is: Freaking Ridonkulous.", "percent_found_helpful": 60.0}, {"review_score": "10", "review_UID": "otajko", "review_date": "2 October 2013", "review_title": "Not the best show but certainly worth checking out and supporting", "review_text": "This is my first review on IMDb ever and I'm not reviewing this show because I think it's the best show in the world (How I Met Your Mother will always hold that place in my heart) but because I think it's the best new show of this season and it's really funny (not perfect, but really funny) and I'm afraid that as the ratings for this show continue to drop it's going to get canceled. But that would be a big mistake because it's a very funny show with lots of potential and a great cast. Also, it has Andy Samberg in it which is kind of a guarantee for me. So give the show a chance and tune in so probably the only good new sitcom this year doesn't get canceled like everyone expects!", "percent_found_helpful": 50.47}, {"review_score": "10", "review_UID": "monis-70587", "review_date": "21 October 2017", "review_title": "Brooklyn Nine Nine", "review_text": "This show is amazing, all actors do an excellent job. This series is so fresh and fun, so true to what everyday life really is. Each character is so different and with any of them we can identify us. The interaction between Jake and Amy is the best of everything, This way is a relation ship in real life, without great \"dramas\" to make it more interesting. All the stories are very well written. We have been able to see the growth of the characters, as Jake, although being a charming child, has matured in what he must and while still being fun. I hope they continue a few more seasons, but if not, please do not give a \"surprise twist\" to spice. As things stand, things are going very well. The basis of your success is everyday life. It becomes an eternity to wait every week for a new chapter. Andy Samberg is such a good actor. I think not many people can imagine how difficult it is to do comedy... a good one. I would not change anything to this show. A thousand congratulations to all involved in its creation.", "percent_found_helpful": 70.0}, {"review_score": "10", "review_UID": "kscoo", "review_date": "1 November 2017", "review_title": "cheesy genius", "review_text": "Can see the jokes coming. Over-acting. Fantastical story lines. The markings of a truly, unmistakably amazing show! Seriously, although everything about this show that should make it a total flop makes it so bloody enjoyable. I have never written a review for any show/movie/game before but this show has me hooked and raving so much that I had to write this review. It's perfect for watching when you feel down and want an instant pick-me-up, when you are bored and have hours to spare, or the perfect 25 minute break from your maddening job or studies. You'll be hooked trust me. You'll even wish you were part of the dysfunctional, over- the-top team at the Brooklyn PD precinct nine-nine!", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "matheu-lex", "review_date": "20 November 2018", "review_title": "An Amazing Tv Show", "review_text": "This is one of the best Comedy TV shows I've seen so far these days.\nThe performance of all actors and actresses is impecable. I wish this tv series could have many more seasons. Would be such a disappointment if it finished after season 6.\nNBC can do it even bigger than it is right now!\nAmazing Comedy!", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "samottoson", "review_date": "3 September 2018", "review_title": "Greatest show on television", "review_text": "Brooklyn Nine-Nine creates a funny take on the seriousness of a cop show, making a hybrid comedy/cop show as it has both a sitcom's funny storyline and plot along with a cop thriller's crime solving. I believe it is better than many other sitcoms because it has the aspect of action to use, unlike shows with one-way sets and minimal camera movement. Overall, I would watch it 3 times in a row without rotating out another show because every time I watch an episode, I notice something I did not last time I watched.", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "nanciabutt", "review_date": "27 July 2018", "review_title": "Is this the new Friends...NO it is the Brooklyn Nine-Nine.", "review_text": "ONE WORD AWESOME....\nSimply amazing and awesome comedy..\nCharacters are so love able and so relate able ..\nEither its Jack Peralta or Amy Santiago..\nyou,ll love them all. on point comedy..its a unique show with something new and that is enough reason to watch it..\nSo go binge it right now...\ngo fall in love...", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "rebeccamac-63769", "review_date": "26 May 2018", "review_title": "Genius comedy show to which nothing compares", "review_text": "This show is amazing in every aspect. It deals with real problems and subjects in the world that people go to, and still manages to bring real loud laughter out. Sly sarcasm and every character is completely different yet loveable and intriguing. Brilliant.", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "shaiqbaig", "review_date": "11 May 2018", "review_title": "it becoming funnier after every episode", "review_text": "So when i started the show. the show was kinda 8.3 on rating for me then next season rating i gave is 8.5 then another season 8.8 then another the fourth which i consider thee best 10/10 because it become hilarious from top-end. they make a lot of great punch lines . a lot great acting. not just from one guy all of them. and season 5 is for me till now is 9/10. as i like it and laugh in a lot of episodes. i think its a great show in every kind of aspects.", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "kmata-65796", "review_date": "3 April 2018", "review_title": "Love it !!!", "review_text": "Love it !!! It's the best serial i have ever seen !!", "percent_found_helpful": 71.43}, {"review_score": "10", "review_UID": "pasada-1", "review_date": "6 February 2014", "review_title": "Jake Jake Jake Jake", "review_text": "Andy Samberg tickles my funny bone and this show is just full of it. Jake Peralta is a really funny character. He wants to be the best cop in town and also the funniest. It's a brilliant idea that can go on forever. I will never stop watching this. Best thing since Arrested Development Season 1-3. I hope they don't pull the plug on this one. Fox TV Network Cats are you listening to us on this one? If you guys are reading this, then know that there are many like me who find this show pretty amazing. And if you pull the plug, we might go out and find fresh air more entertaining than the other crap you play on your channel. I hope you understand and appreciate the following \"Only a FOOL repeats the same mistake and expect a different outcome\". We will just hate you for it. Do you need any more of that? Don't you have enough of it already?", "percent_found_helpful": 51.43}, {"review_score": "10", "review_UID": "garman-67458", "review_date": "29 October 2018", "review_title": "Funniest show on TV", "review_text": "I have always considered that the hallmark of a good comedy is that you can watch it multiple times and it stays funny. I can confirm, after a second watch through of the series, that it Does. Very good show", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "rubieangelinaglew", "review_date": "13 August 2018", "review_title": "it's amazing", "review_text": "Brooklyn nine nine is a masterpiece. it is funny and so well written that every single episode is interesting. all the characters are so definined and genuinely interesting even though they are all so different - i love them all. they also defy normal stereotypes of characters that are normally portrayed in a tv show. i love this show so much and i think that everyone should watch it because it is just so insanely good.", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "jakebirkel", "review_date": "11 August 2018", "review_title": "Law & Order meets F.R.I.E.N.D.S!", "review_text": "Just about everything about this show is perfect for anyone seeking high-octane comedy show about a police workplace. I mean, it was created by Michael Schur, so how could it not be great? With diverse and multi-dimensional characters played by some fantastic performances and led by the unequivocally hilarious Andy Samberg, this is practically 23 minutes of satire per week with the courage to explore themes few other shows on the air have. Every season, the writers seem to tackle a social issue that's prevelant in today's landscape. I won't spoil anything, you'll just have to watch this wonderful masterpiece yourself!", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "tehreemshabbir", "review_date": "8 August 2018", "review_title": "BEST. SHOW. EVER.", "review_text": "I have never went out of my way to ever write a review for a show but this show is SO good if it gets cancelled EVER i would be furious", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "efoylell", "review_date": "15 January 2018", "review_title": "so good", "review_text": "This is how to make good comedy that doesn't offend anyone. The hangover take notes.", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "getndgive", "review_date": "2 April 2018", "review_title": "MUST WATCH!", "review_text": "I don't get why anyone would hate this show. It is actually very funny (if you have a good sense of humour) and is not only focused on dating and stuff, which is like the main theme of most sitcoms. Its very different and hilarious! Each and every character is super funny in their own way, and each actor plays them beautifully. I love the little flashbacks and I specially love Andy Samberg's expressions. I personally think that he is awesome, and so are all the other actors. And we all love to see some mystery and police work, but are not always in the mood to be scared to death. This show also has a little element of suspense at times, which makes it a complete package. When I stumbled upon this show, I hit the bing-pot! Don't listen to anyone who tells you that this show sucks unless you give it a try yourself.", "percent_found_helpful": 63.64}, {"review_score": "10", "review_UID": "lucywilsongreen", "review_date": "11 October 2015", "review_title": "Bloody Brilliant", "review_text": "Brooklyn Nine-Nine ★★★★★Plot | A group of NYPD detectives solve crimes and mess up. A lot. Review | It is no secret that I am not a comedy kind of gal. Little can make me laugh in this cold, cold world. However, this show is probably the best television series I am watching at the moment. The writers of Parks and Rec have brought us a sarcastic documentary style sitcom set in the 99th precinct of Brooklyn, New York. The writers have struck a perfect balance of realism and farce making these characters funny but real. They take stereotypes of people and 180 them. The plot is immensely gripping and actually funny, the chemistry is insane. I cannot describe how much I have come to love the characters and feel for them when things didn't exactly go their way. I also love a bit of low-key feminism, because this show really wipes the floor when it comes to the sexist comedy that is so often used in 'Comedy Sit Coms' nowadays. This show is also packed with representation; there are so many different cultures that come into play. It also explores LGBTAQ+ and as I have mentioned before, feminism. This show is lead by a mostly female non-white cast, which for it's female and/or non-white watchers is incredibly refreshing. Seeing out stories on screen is a truly warm and fuzzy feeling!", "percent_found_helpful": 51.72}, {"review_score": null, "review_UID": "alvauu", "review_date": "23 June 2015", "review_title": "Awesome show :D", "review_text": "Brooklyn nine-nine is such an amazing show! Jake Peralta is such a good character; he's a feminist, his favorite artist is Taylor Swift and he's awesome. What's there not to love about him, seriously? Amy Santiago is super funny, too, and reminds me a lot about myself. The show also features a non-stereotypical LGBTQ character (Captain Ray Holt) and is super diverse overall. But it's also SO FUNNY! Mike Schur and Dan Goor are such good comedy writers (they both also wrote episodes for parks and recreation, so if you loved that you will love this). So please, guys, just do yourselves a favor and WATCH BROOKLYN NINE- NINE.", "percent_found_helpful": 50.0}, {"review_score": "10", "review_UID": "thomturkenburg", "review_date": "11 February 2019", "review_title": "Best sitcom ever", "review_text": "This show is So funny and also So wel acted by the whole cast im impressed how captain holt can keep a straight face in Some scenes and Sure i like Classic sitcoms like friends But This show is perfect thats why i gave it a 10/10 This show cured my from my depression\nI love This show So much", "percent_found_helpful": 62.5}, {"review_score": "10", "review_UID": "claramariamarinescu", "review_date": "27 January 2019", "review_title": "A new type of comedy", "review_text": "Seriously this show is amazing and funny and overall the best\nEven though it is a comedy the characters are incredibly well rounded and so relatable\nIt's also based on the life of police and is surprisingly accurate and it's the only show I've seen that has so much love and care put into it10/10 would recommend", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "bella2019", "review_date": "5 January 2019", "review_title": "One of the funniest and greatest show I watched", "review_text": "It is a great show. If you are looking for a comedy show to watch with your family, YOU SHOULD WATCH THIS. I love everything about it and it makes me laugh every time.Love you and thank u 99", "percent_found_helpful": 66.67}, {"review_score": "9", "review_UID": "cocobinay", "review_date": "10 December 2018", "review_title": "Unique and fun!", "review_text": "I'm a late comer here, but I've found myself binge-watching 3 seasons in a week.Really fun show, lovable characters: Holt is a riot, Gina is a queen wolf, Rosa is the best badass character you've ever seen, and of course, Terry steals the show!\nMy one beef with the show is the character of Jake who starts out adorably immature, but unfortunately with every season, trends towards an irritantly unfunny Ace Ventura copycat.Give the show a watch, and you'll understand why many fans couldn't handle it being cancelled. They were right, we got something fun and unique here!", "percent_found_helpful": 66.67}, {"review_score": "8", "review_UID": "erikel-99814", "review_date": "9 October 2018", "review_title": "One of the best series I know", "review_text": "This comedy series always makes me smile. In almost every episode I can recognize my self and just laugh straight out. \nWe all have a little bit of Charles boil.", "percent_found_helpful": 66.67}, {"review_score": "9", "review_UID": "allairefloriane", "review_date": "6 September 2018", "review_title": "Very nice TV show", "review_text": "Funny, with a bit of actionAll is their for entertainment, and not too long and complicatedGreat TV show, continue like this :)", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "inejghafa", "review_date": "21 January 2018", "review_title": "THE BEST SHOW", "review_text": "You want an incredibly diverse tv show? Check. The squad has two black men(one who is gay), two latina women(one who has just come out as bi in '99'), one white women, two white men(one who is jewish). \nYou want an actually funny tv show? Check. While yes, there are always going to be some episodes that rise above the rest, I have yet to watch and episode that is generally bad. \nYou want a comedy that deals with issues in a lighthearted way? Check. From casual references to the racism and homophobia Holt faces, to an entire episode about when Terry gets profiled while looking for his daughter's toy, as well as Rosa(who is bisexual)coming out to her parents and seeing the biphobia.I know so many people who watch it, and not one has said they hate t, so jump on teh bandwagon, and watch this amazing tv show.", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "bhardwajajit12", "review_date": "19 December 2017", "review_title": "A+++++ SHOW", "review_text": "The awesome cast, the flawless plots and the diversity in nature of the characters are just some of the things that make it a high octane show..HIGHLY RECOMMENDED for a kid from 5 to people over 100.It balances a perfect blend of action, romance and a hella lot of humour thats gonna enthrall you from the first minute of the first episode.Notable Mentions: Jake Peralta and Ray Holt are just the BEST with addition of Santiago, Terry, Boyle, Hitchcock and Scully..better not mention Diaz she doesnt like it.", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "bramble-83057", "review_date": "12 December 2017", "review_title": "one of the best shows ever", "review_text": "I love it so much- the characters- the relationship between them, the story and just everything about it. would definitely recommend and definitely one of the best shows of all time- but i know it's not everyones cup of tea but don't listen to people who say the acting is bad because thats not true", "percent_found_helpful": 66.67}, {"review_score": "10", "review_UID": "djx360", "review_date": "9 December 2013", "review_title": "FINALLY ! Not a dating show \\m/", "review_text": "Refreshing show, it couldn't have come at a better time. It's way too boring to see a new sitcom & come across the same pointless hook ups, plots revolving around sex & story going nowhere, thankfully this show keeps it lightheaded & kinda reminds me of Seinfeld + a bit of interesting things going on.Jake Peralta the protagonist feels like a lead character taken from a anime. The energetic, cocky yet ambitious personality catches the eye & he becomes instantly likable. Rest of the casting is well done & nothing feels out of place from the entertainment point of view.I am really excited to see this show grow, here's to awesomeness :D", "percent_found_helpful": 43.59}, {"review_score": "10", "review_UID": "jeffcheznowski", "review_date": "12 January 2014", "review_title": "The Show is archer, but with people", "review_text": "The show is basically archer but its not a cartoon. One show is CIA one is police. both main characters are complete dicks and idiots but are great at their job. There is the annoying boss. In both shows there the protagonist has a close co-worker woman who is always on his back and thinks there better at the job. Both shows have a useless worker and they even look the same (Cyril and Detective Charles Boyle). Both shows take a really serious job as joke. & there both great.The Show without comparing it to a \"cartoon\" is well written (at least I think it is) and has great acting. It does involve a lot of sex based jokes but than again those are the best. So all said and done I hope it does well because I want to watch a lot more. Most importantly Brooklyn nine-nine is great!Enjoy watching it. or not.", "percent_found_helpful": 44.12}, {"review_score": "9", "review_UID": "alysia-johnsonb", "review_date": "3 December 2014", "review_title": "Such a good show", "review_text": "I'm in love with this show, and I'm not a \"tv person\". Its the one show that I can watch with my significant other to melt away stress and have a few laughs without having to cave in to shows like Southpark and shows that have become increasingly less appealing the older I get. Is some of the humor childish in Nine-Nine? Yes. But it has a lot of heart. Its not just stupid for the sake of being stupid. You genuinely grow to love all of the characters and their quirks. And to those reviewers who \"can't understand Rosa\" or whatever --- seriously? Is life so serious that having to understand every single character on a comedy show makes or breaks a show? As if! This is comedy gold. Love it.", "percent_found_helpful": 44.44}, {"review_score": "10", "review_UID": "mweber-29126", "review_date": "10 February 2019", "review_title": "Amazing.", "review_text": "I love this show so much. Have watched since the beginning and have never been disappointed. Not only is it hilarious, but the characters are so real and more diverse than most tv shows. B99 also takes time to deal with real issues that go on in the world while still managing to be full of comedy. I was so shocked and saddened when Fox cancelled the series and elated when it was picked up by NBC. Some have commented that the quality is not the same as it was with Fox however I continue to see high quality tv. I'm hoping NBC keeps it going for at least a couple more years.", "percent_found_helpful": 57.14}, {"review_score": "10", "review_UID": "alexni-83895", "review_date": "9 February 2019", "review_title": "How to not grow up", "review_text": "Brooklyn Nine-Nine, the most freshly cut apple in the bunch.this show is SOMETHING else.this show is made for people like me, people who like fresh and funny lines in every conversation. Delivered by mister \"Grownup\" himself Jake Peralta.The show is freshly cut banter and anxiety dealt with in a funny way. Plus it also brings reaviling plot twist and asses to save along the way. this keeps the show momentum going in every episode.", "percent_found_helpful": 57.14}, {"review_score": "10", "review_UID": "alecthebae", "review_date": "17 January 2019", "review_title": "I've never actually watched the show", "review_text": "My friend made me rate this 10 stars because she was upset that it's rating was lower than Game of Thrones.", "percent_found_helpful": 57.14}, {"review_score": "10", "review_UID": "dedrabarefoot", "review_date": "26 January 2018", "review_title": "Best show I've ever seen", "review_text": "I've seen every episode that's out so far (Most of them more than once), simply because it's such a good show. It's primarily comedy, but little splashes of every other genre are in there. The premise is a group of characters working together at a detective agency and it is basically a satire cop show, one episode even has them on the set of another cop show.\nIt always has the scenario being the opposite of what you'd expect without anybody going too far out of character. Even when you're trying to expect the opposite of the obvious, it still is unpredictable and makes you laugh out loud. The main character is Jake Peralta, he's a really good detective and he's really immature. He is obsessed with the movie 'Die Hard' and apparently hasn't been to a dentist in seven years.\nTheir gay, black Captain has barely any facial expression and is often described as robotic, until season two, they give him an arch nemesis, bringing out his immature side, this may not sound like a comedy character, but trust me when i say it is. \nAmy Santiago is your stereotypical 'teacher's pet', but that doesn't mean that the humour gets old after a while, she's also extremely competitive. Charles Boyle is possibly the funniest character on the show, he's Jake's best friend, he's jealous of all of Jake's other friends and is obsessed with food. He also doesn't seem to realise how some things sound, for example, in one episode after he punches somebody, he spits them and says 'I've got a lot more where that came from, I've got a real wet mouth'. \nRosa Diaz is also an amazing character, for the first few seasons, she is kind of emotionless. She's considered the badass in the group.\nGina Linetti isn't a detective, she's a secretary. She's basically a walking stereotype of the 'kids these days', she says that C- is the perfect grade because 'you pass, but you're still hot', she barely does anything apart from use her phone and uses way too many abbreviations, for some reason, she'll always win a battle though.\nHitchcok and Scully are the two most useless detectives on the force. They should've retired long ago, but hey, why not creep everybody out and get diabetes. They're basically one person, don't get me wrong they do have some unique traits, however. Why they haven't been fired, I'll never figure that out.\nTerry Jeffords is the last main character, it's hard to explain what's funny about him but he just is funny. He's the second in command after the captain, he's really muscular and he loves yogurt. Despite this, he's still a funny character due to his one liners.\nAnother thing that I love about this show is the things that'll usually occur once a season, they have several things that'll happen once in every season, it's hard to explain what I mean, my two favourites of these are the pontiac bandit and the halloween heist. The pontiac bandit is a criminal that Jake is kind of friends with, but he also wants to send him to jail, he's extremely funny. The halloween heist is a bet that was made in season one between Jake and the Captain, Jake had to steal the Captains medal of valor by midnight, they did a variation on the bet the next year, and the year after that, a variation on the variation and it's extremely funny and unpredictable.\nAs well as humour it has great ongoing storylines ranging from friendships to taking down serial killers.\nTo summarise, if you still don't want to watch the show, then you need to see a therapist.", "percent_found_helpful": 57.14}, {"review_score": "10", "review_UID": "stupotrugby", "review_date": "27 July 2015", "review_title": "Brilliant!!!", "review_text": "A genuinely funny series with likable characters and great mini stories in each episode! Perfectly cast, Captain Holt is brilliantly dry, Peralta suitably brilliant and child like! I struggle to find anything negative to say about this great show. Boyle to me is a stand out character and shows the silly side of policing rather than the boring usual csi type shows littered over TV. It is at times silly and juvenile but more wity good set pieces and more sophisticated humour ot balances perfectly. Andy Samberg will take most if the plaudits but it really is a great ensemble cast with hitchcock and scully still getting laughs as bit part players in the show.recommend highly as the funniest show on TV at the minute, right up there with big bang theory", "percent_found_helpful": 46.67}, {"review_score": "3", "review_UID": "ycland", "review_date": "9 February 2014", "review_title": "Not horrible yet not all that good either.", "review_text": "I watched the first five episodes of this new comedy, mostly because it received a Golden Globe for best TV comedy series.I spoke to a few friends that have watched this series and they said the comedy seemed somewhat like a flat The Office, Parks and Recreation or even Office Space. After watching a few episodes it felt as if that's the type of audience they were shooting for yet seemed to miss. The Office, while being fairly low-brow and borderline slap- stick, at least was able to deliver jokes and circumstances that were believable yet absurd at the same time and many can relate to this if you've ever been in a cubicle style office job for any extended period of time.Brooklyn Nine-Nine, to me, missed that gray area between the totally absurd and a documentary of a police station. Instead of riding that fine line, which makes a comedy work, they went too far off into absurdity land and anything there to anchor them back to reality is too far removed that this eventually begins to feel like a show full of absurd police-precinct jokes and 60 second skits mashed together to form a thoroughly blended plot. To top all of it off, the absurdities in these skits are executed by equally absurd character personalities.I actually like some of the actors in this show like Terry Crews, Andre Braugher and to a lesser extent Andy Samberg and I think with some re- tooling of the writing it could really work. I'm honestly confused as how the judges for the Golden Globe could pick this as the best comedy TV series. Maybe I'll check it out if it lasts through another season.", "percent_found_helpful": 31.91}, {"review_score": "1", "review_UID": "arlo-17669", "review_date": "27 March 2015", "review_title": "one of the stupidest shows i have ever seen", "review_text": "I tried watching this with a couple of friends they said its really funny. I did not laugh once the humor is either childish or just dry and unoriginal. It is terrible writing terrible filming terrible acting this show is literally awful. I don't get how people find it funny, it doesn't have one single redeeming quality I will be very surprised if it Lasts much longer its the kind of show that is laughable in a very bad way. Just take this dry stupid excuse for a sitcom of the air already I would rather watch Disney channel then this garbage. Its ashame as well because there's a couple of actors I've liked on other things but they do not deliver in any way on this show. Absolute stupidity enough said.", "percent_found_helpful": 30.82}, {"review_score": "2", "review_UID": "FlushingCaps", "review_date": "4 February 2014", "review_title": "Another moronic laugh-less \"comedy\"", "review_text": "Just watched the rerun of the pilot for Brooklyn Nine-Nine. I thought it was a marvelous example of why so many people say that current TV comedies are pathetic. There was one small chuckle it got from me during the entire 20 minutes (minus ads, of course).I could not stand the self-proclaimed best detective on the squad. His inane behavior was disgusting and his putting others in jeopardy by stopping to say stupid joke lines right in the middle of apprehending a suspect was less police-like than anything the Three Stooges ever did when they portrayed cops.I couldn't understand the female detective who happily agreed to see a movie with a colleague, then after challenging him to pick something good, suddenly canceled—right after he bought tickets. Before I could figure that out, she appeared to have changed her mind again.The bet about who makes the most arrests between the two detectives was also stupid—anyone can make a lot of arrests. It would only make sense if they were betting on who got the most convictions.When Jake got up at the meeting near the beginning and proceeded to waste everyone's time by talking about trivia regarding old people while he was supposed to be giving a run down on a recent crime, I thought we had tumbled to the bottom of the hill, but alas, it just continued sliding down, leaving me wondering how anyone gets any laughs from this tripe.", "percent_found_helpful": 29.61}, {"review_score": "6", "review_UID": "bob-1135", "review_date": "6 April 2018", "review_title": "What's happening in the 99?", "review_text": "Apart from the opening episodes when Jake and Rosa were released from jail this series has been a severe let down. We seem to be looking at multiple storylines going no where in particular. Bring back 99!", "percent_found_helpful": 50.0}, {"review_score": "9", "review_UID": "nozplays", "review_date": "23 July 2016", "review_title": "Brilliant Show, Andy Samberg is Beast", "review_text": "Funny. As. F**K. Those are the first words that come to mind when you ask me what I think of B99. This hilarious comedy set in Brooklyn's 99th police precinct is definitely one of the funnies show I've ever watched. I especially love (Spoiler Alert) Gina and Charles's relationship that lasted from 'Charges and Specs' (Season 1) to 'The Mole' (Season 2). in that time, they managed to have sex 16 1/3 times. (In the words of Gina Linetti \"Don't ask how that happened).This TV show mixes my favourite actor and music artist, Andy Samberg, and an amazingly funny plot in every episode. If you enjoy Brooklyn Nine Nine, I suggest you watch 'Hot Rod' and 'Popstar, Never Stop, Never Stopping.' If you ever go for a snack, just remember that, \"Terry Loves Yogurt!\"", "percent_found_helpful": 50.0}, {"review_score": "9", "review_UID": "youmustbecrazy1072", "review_date": "28 January 2015", "review_title": "The best comedy on TV.", "review_text": "I don't understand how someone can give this show 2/3 stars, let alone one. If a reviewer says it's that bad, I wish just one of them would have stated what show currently was deserving of 8/9/10 stars....just so I could get an idea of what they find funny. I like the fact that it's sometimes over the top and soooo unlike any of the other shows, ie,...the seriousness of every other cop show out there. EVERY other cop show out there is very serious. They tackle corruption, killings, spousal abuse, drugs, etc...and the detective work involved. The only difference between every other cop show out there is that they are filmed at different locations, with different actors, and had different writers...writing about the same topics.I think Bklyn 9-9's writing is silly, funny, and over the top. The characters mesh perfectly and I sometimes laugh almost as soon as the characters start with their retort. If you are the serious type and can't relax, do not watch the show. If you are constantly evaluating the cop tactics, how the chain of command functions, the way the uniforms look and cop jargon, do not watch the show. If you don't fall into those groups...watch the show.", "percent_found_helpful": 40.0}, {"review_score": "1", "review_UID": "random9530", "review_date": "11 January 2014", "review_title": "It's nothing more than a Police Academy wannabe", "review_text": "Maybe this show would be better if they dumped Adam Sandberg. He is just over the top not funny. His stupid childish antics make me roll my eyes. His attempt at forced comedy is painful. The rest of the cast is also fairly weak, but let's try with dumping Sandberg and his completely unfunny antics first. I was really looking forward to this show when I first saw the previews. Not unlike a movie trailer, the TV spots show all of the funny parts out of context. When you see those same lines in context, they become very unfunny. That is an amazing feat. I watched the first episode and was just floored that I didn't laugh once. I gave it a second chance, and again, failed to even crack a smile. Looking back at those episodes, my dislike for the show centers around Sandberg.", "percent_found_helpful": 29.41}, {"review_score": "1", "review_UID": "SanteeFats", "review_date": "9 October 2013", "review_title": "Just not good", "review_text": "I really tried to like this show. I found the pilot to be inane and not very funny but still kept watching episodes until I just couldn't take it anymore. Samberg plays Peralta. He is NOT funny in this role. His character is just a five year old in an adults body. The jokes are stupid, juvenile, and just terrible. The acting is really poor but I attribute that to the writing because I have seen a couple of the actors in other roles or on stage as a stand up (Peritti) and they were a lot better than the character's they have in this dumb series. Personally I don't see this debacle going even one season unless it is only scheduled to run for 5-10 episodes. Man do I hope so any way because then maybe something good will replace it.", "percent_found_helpful": 29.23}, {"review_score": "4", "review_UID": "RiseOf_Kratos", "review_date": "26 August 2018", "review_title": "Not That Much Hilarious As People Are Bragging", "review_text": "Yeah, that's right... It's not that funny. I don't know how people gave it 10-stars. When I saw the ratings I decided to watch it. I watched 8 episodes and waited for a single good episode but hell I'm disappointed. Comedy in this show is way below average. Actors are terrible. Tbh, I'm not certain which one is more hideous Actors or Script. There is no punch line at all, just lame comedy.\nThe character, Gina Linetti played by Chelsea Peretti is the most awful one. Her acting can single handily make you hate the show (Believe me It's true). \nLook, man/girl if you're looking for a good comedy show then take this advice - Watch the first episode. If you like it then go for it and if you don't then don't wait for a decent laughable episode because there is no such thing in Brooklyn Nine-Nine for you.", "percent_found_helpful": 37.14}, {"review_score": "2", "review_UID": "jonnithomas", "review_date": "3 October 2014", "review_title": "this show is contrived and really not funny.", "review_text": "I am amazed at how some people think that this show is wonderful.The acting is really unrealistic and there isn't a single pleasant or believable character. It is almost as tho the actors realise how bad the script is so they don't even try to act.I really did try to find some of it (any of it) funny but it simply isn't. The police are 2 dimensional and there is nothing close to any subtlety or humour.I think it may appeal to some children of around 12 but certainly my children at that age would have described it as 'stupid' and refused to watch it.children younger than 12 probably wouldn't understand a lot of the references in it so I'm not sure what audience it is aimed at.blazing saddles it isn't.", "percent_found_helpful": 29.38}]}
]